## Project: DNS

#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`

<details><summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```diff
aws_route53_zone.zone: Refreshing state... [id=Z08509072ZDU78NDNFK37]
aws_ssm_parameter.hosted_zone_id: Refreshing state... [id=/eliasb/hosted_zone_id]
aws_ssm_parameter.test_ssm: Refreshing state... [id=/eliasb/dns_test_ssm]
aws_ssm_parameter.hosted_zone_id_useast: Refreshing state... [id=/eliasb/hosted_zone_id]
aws_route53_record.root_record: Refreshing state... [id=Z08509072ZDU78NDNFK37_aws.eliasbrange.dev_A]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_ssm_parameter.test_ssm has changed
!   resource "aws_ssm_parameter" "test_ssm" {
        id        = "/eliasb/dns_test_ssm"
        name      = "/eliasb/dns_test_ssm"
+       tags      = {}
        # (7 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_ssm_parameter.test_ssm2 will be created
+   resource "aws_ssm_parameter" "test_ssm2" {
+       arn       = (known after apply)
+       data_type = (known after apply)
+       id        = (known after apply)
+       key_id    = (known after apply)
+       name      = "/eliasb/dns_test_ssm2"
+       tags_all  = (known after apply)
+       tier      = "Standard"
+       type      = "String"
+       value     = (sensitive value)
+       version   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @eliasbrange, Action: `pull_request`, Working Directory: `dns`, Workflow: `DNS - Pull request`*
<!-- Sticky Pull Request CommentDNS -->